tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "universal-ctags/universal-ctags"
# Any-to-PostScript filter
brew "a2ps"
# Library for decoding ATSC A/52 streams (AKA 'AC-3')
brew "a52dec"
# AAC-supporting version of mp3gain
brew "aacgain"
# Portable ASCII art graphics library
brew "aalib"
# Renders mathematical expressions as ASCII art
brew "aamath"
# Utilities to aid shell scripts or command-line users
brew "aardvark_shell_utils", link: false
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# High performance key/value database
brew "berkeley-db"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# GNU database manager
brew "gdbm"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Work with ID3 metadata in .mp3 files
brew "eye-d3"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Portable Foreign Function Interface library
brew "libffi"
# Perl compatible regular expressions library
brew "pcre"
# Core application library for C
brew "glib"
# Music related metadata search engine with command-line interface and C API
brew "glyr"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Cross-platform Audio Library
brew "libao"
# C library for creating MusicBrainz and freedb disc IDs
brew "libdiscid"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Generate a CUE sheet from a CD
brew "mkcue"
# Highly capable, feature-rich programming language
brew "perl"
# Ogg Vorbis CODEC tools
brew "vorbis-tools"
# Better CD Encoder
brew "abcde"
# Development kit for the Java programming language
brew "openjdk"
# Java build tool
brew "ant"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Armed Bear Common Lisp: a full implementation of Common Lisp
brew "abcl"
# ABC music notation software
brew "abcm2ps"
# Converts abc music notation files to MIDI files
brew "abcmidi"
# Provides session management: i.e. separate programs from terminals
brew "abduco"
# Quickly generate random documents that match an ABFN grammar
brew "abnfgen"
# Address book with mutt support
brew "abook"
# Perl tools for bioinformatics, genomics and life science
brew "bioperl"
# LLVM's OpenMP runtime library
brew "libomp"
# Lightning memory-mapped database: key-value data store
brew "lmdb"
# Basic Local Alignment Search Tool
brew "blast"
# Find antimicrobial resistance and virulence genes in contigs
brew "abricate"
# C++ Common Libraries
brew "abseil"
# Portable sound library
brew "libmikmod"
# Low-level access to audio, keyboard, mouse, joystick and graphics
brew "sdl"
# Sample multi-channel audio mixer library
brew "sdl_mixer"
# Dark 2D side-scrolling platform game
brew "abuse"
# GNU multiple precision arithmetic library
brew "gmp"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# Zstandard is a real-time compression algorithm
brew "zstd"
# GNU compiler collection
brew "gcc"
# Portable abstraction of the hierarchical topology of modern architectures
brew "hwloc"
# Asynchronous event library
brew "libevent"
# High performance message passing library
brew "open-mpi"
# Genome sequence assembler for short reads
brew "abyss"
# Reference implementation of SMPTE ST2065-4
brew "aces_container"
# Search tool like grep, but optimized for programmers
brew "ack"
# Crossassembler for multiple environments
brew "acme"
# Automatic certificate acquisition tool for ACME (Let's Encrypt)
brew "acmetool"
# OS-independent implementation of the ACPI specification
brew "acpica"
# Run your GitHub Actions locally 🚀
brew "act"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Apache ActiveMQ: powerful open source messaging server
brew "activemq"
# Apache Portable Runtime library
brew "apr"
# C++ API for message brokers such as Apache ActiveMQ
brew "activemq-cpp"
# Blocking, shuffling and loss-less compression library
brew "c-blosc"
# OpenFabrics libfabric
brew "libfabric"
# Library for manipulating PNG images
brew "libpng"
# NaCl networking and cryptography library
brew "libsodium"
# Python bindings for MPI
brew "mpi4py"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# High-performance, asynchronous messaging library
brew "zeromq"
# Next generation of ADIOS developed in the Exascale Computing Program
brew "adios2"
# Processes triangulated solid meshes
brew "admesh"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Binary I/O stream class library
brew "libbinio"
# Free, hardware independent AdLib sound player library
brew "adplug"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Recompression utilities for .PNG, .MNG, .ZIP, and .GZ files
brew "advancecomp"
# Software library to render fonts
brew "freetype"
# MAME with advanced video support
brew "advancemame"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Manage compile and link flags for libraries
brew "pkg-config"
# X.Org: pthread-stubs.pc
brew "libpthread-stubs"
# X.Org: Protocol Headers
brew "xorgproto"
# X.Org: A Sample Authorization Protocol for X
brew "libxau"
# X.Org: X Display Manager Control Protocol library
brew "libxdmcp"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# X.Org: Core X11 protocol client library
brew "libx11"
# X.Org: Library for common extensions to the X11 protocol
brew "libxext"
# X.Org: Library for the Render Extension to the X11 protocol
brew "libxrender"
# Real-time data compression library
brew "lzo"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Image manipulation library
brew "jpeg"
# TIFF library and utilities
brew "libtiff"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Audio encoder which generates ATSC A/52 compressed audio streams
brew "aften"
# Fast, simple and clean video downloader
brew "annie"
# Shell plugin manager
brew "antibody"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Library and utilities for processing GIFs
brew "giflib"
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# High dynamic-range image file format
brew "openexr"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Perceptual video quality assessment based on multi-method fusion
brew "libvmaf"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Google App Engine
brew "app-engine-python"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Simple system information tool written in Python
brew "archey4"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# GNOME accessibility toolkit
brew "atk"
# Python frame stack sampler for CPython
brew "austin"
# Asynchronous DNS library
brew "c-ares"
# HTTP/2 C Library
brew "libnghttp2"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Platform built on V8 to build network applications
brew "node"
# Code automation for every language, library and framework
brew "autocode"
# Macro processing language
brew "m4"
# Automatically formats Python code to conform to the PEP 8 style guide
brew "autopep8"
# Python 2 and 3 compatibility utilities
brew "six"
# Simple python script to download Bandcamp albums
brew "bandcamp-dl"
# Security-oriented static analyser for Python code
brew "bandit"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Garbage collector for C and C++
brew "bdw-gc"
# Python code formatter
brew "black", restart_service: true
# Collection of portable C++ source libraries
brew "boost"
# C++ library for C++/Python3 interoperability
brew "boost-python3"
# Cryptographic algorithms and formats library in C++
brew "botan"
# Fancy interface to the Python interpreter
brew "bpython"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Version control system implemented in Python with multi-format support
brew "breezy"
# Creates executables with SBCL
brew "buildapp"
# Implementation of the Actor Model for C++
brew "caf"
# General purpose programming language in the ML family
brew "ocaml"
# C++ template library for linear algebra
brew "eigen"
# C unit testing framework
brew "check"
# Ultralightweight JSON parser in ANSI C
brew "cjson"
# Unit testing framework for C
brew "cmocka"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Protocol buffers library
brew "protobuf-c"
# C client for the NATS messaging system
brew "cnats"
# Simple, elegant, Pythonic functional programming
brew "coconut"
# Next-gen compiler infrastructure
brew "llvm"
# Cross-platform application and UI framework
brew "qt@5"
# Open Inventor 2.1 API implementation (Coin) with Python bindings (Pivy)
brew "coin3d"
# Configurable talking characters in ASCII art
brew "cowsay"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# C++ Requests, a spiritual port of Python Requests
brew "cpr"
# C string library for manipulating Unicode strings
brew "libunistring"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source suite of directory software
brew "openldap"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Compiler for writing C extensions for the Python language
brew "cython"
# High-level C binding for ZeroMQ
brew "czmq"
# Turn other processes into daemons
brew "daemon"
# Run a command as a UNIX daemon
brew "daemonize"
# Portable low-level networking library
brew "libdnet"
# Network packet logger and soft tap daemon
brew "daemonlogger"
# Collection of tools for managing UNIX services
brew "daemontools", restart_service: true
# SOCKS server and client, implementing RFC 1928 and related standards
brew "dante"
# Network intrusion prevention and detection system
brew "daq"
# Distributed version control system that tracks changes, via Haskell
brew "darcs"
# Python docstring argument linter
brew "darglint"
# Control the macOS dark mode from the command-line
brew "dark-mode"
# Small static webserver without CGI
brew "darkhttpd"
# Audio codec
brew "opus"
# C library for files containing sampled sound
brew "libsndfile"
# Library for sample rate conversion of audio data
brew "libsamplerate"
# Audio Connection Kit
brew "jack", restart_service: true
# Live audio streamer
brew "darkice"
# Command-line weather from the darksky.net API
brew "darksky-weather"
# Network traffic analyzer
brew "darkstat"
# Fallback theme for FreeDesktop.org icon themes
brew "hicolor-icon-theme"
# GUI toolkit
brew "gtk+"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Dynamic Animation and Robotics Toolkit
brew "dartsim"
# JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dasel"
# POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew "dash"
# Generate Dash documentation from HTML files
brew "dashing"
# Internet file retriever
brew "wget"
# Search API docs offline, in your terminal or browser
brew "dasht"
# Macro assembler with support for several 8-bit microprocessors
brew "dasm"
# Apache Arrow DataFusion and Ballista query engines
brew "datafusion"
# Tool to perform numerical, textual & statistical operations
brew "datamash"
# Open source multi-tool for exploring and publishing data
brew "datasette"
# Fortran time and date manipulation library
brew "datetime-fortran"
# Tools to manipulate dates with a focus on financial data
brew "dateutils"
# CLI tool to run policies against Kubernetes manifests YAML files or Helm charts
brew "datree"
# AV1 decoder targeted to be small and fast
brew "dav1d"
# Library and tools for advanced file I/O with HTTP-based protocols
brew "davix"
# POP/IMAP/SMTP/Caldav/Carddav/LDAP exchange gateway
brew "davmail", restart_service: true
# Version control for MySQL databases
brew "db-vcs"
# Digramic Bayesian classifier
brew "dbacl"
# Tool to deploy sandboxed MySQL database servers
brew "dbdeployer"
# Computes the SHA1 hash of schema and content of a SQLite database
brew "dbhash"
# Lightweight, framework-agnostic database migration tool
brew "dbmate"
# Message bus system, providing inter-application communication
brew "dbus"
# GLib bindings for the D-Bus message bus system
brew "dbus-glib"
# Validating XML parser
brew "xerces-c"
# XQuery and XPath 2 command-line interpreter
brew "xqilla", link: false
# Embeddable XML database with XQuery support and other advanced features
brew "dbxml"
# DTS Coherent Acoustics decoder with support for HD extensions
brew "dcadec"
# Enhanced version of dd for forensics and security
brew "dcfldd"
# Library for USB device access
brew "libusb"
# Linux driver for dream cheeky USB message board
brew "dcled"
# DICOM to NIfTI converter
brew "dcm2niix"
# Command-line interface for managing DC/OS clusters
brew "dcos-cli"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Digital camera RAW photo decoding software
brew "dcraw"
# Converts boring normal dates to fun Discordian Date
brew "ddate"
# DDC monitor controls (brightness) for Mac OSX command-line
brew "ddcctl"
# Update dynamic DNS entries
brew "ddclient", restart_service: true
# DuckDuckGo from the terminal
brew "ddgr"
# GNU data recovery tool
brew "ddrescue"
# File conversion utility for older formats
brew "deark"
# Miscellaneous utilities specific to Debian
brew "debianutils"
# Command-line tool for getting & setting the default browser
brew "defaultbrowser"
# Analyze C/C++ files for unnecessary headers
brew "deheader"
# LetsEncrypt/acme client implemented as a shell-script
brew "dehydrated"
# Framework for testing other programs
brew "deja-gnu"
# Programmatically minimize files to isolate features of interest
brew "delta"
# Debugger for the Go programming language
brew "delve"
# More powerful symbol demangler (a la c++filt)
brew "demumble"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Portable Java library for manipulating DNS clouds
brew "denominator"
# Superfast compression library
brew "density"
# Go dependency management tool
brew "dep"
# OWASP dependency-check
brew "dependency-check"
# Standard SGML representation system for technical documents
brew "docbook"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Turn a pool of Docker hosts into a single, virtual host
brew "docker-swarm"
# Tool that bootstraps your dotfiles
brew "dotbot"
# Binary-decimal and decimal-binary routines for IEEE doubles
brew "double-conversion"
# DNAnexus toolkit utilities and platform API bindings for Python
brew "dxpy"
# Python bindings of Eigen library with Numpy support
brew "eigenpy"
# Yahoo! JavaScript and CSS compressor
brew "yuicompressor"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Programming language for highly scalable real-time systems
brew "erlang"
# Official Go implementation of the Ethereum protocol
brew "ethereum"
# Project Euler command-line tool written in Python
brew "euler-py"
# Modern replacement for 'ls'
brew "exa"
# Automatically handle virtualenvs for python scripts
brew "fades"
# AI for playing Chess variants
brew "fairymax"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Minimalistic plugin API for video effects
brew "frei0r"
# Generic library support script
brew "libtool"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound", restart_service: true
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Cryptographic & SSL/TLS library
brew "mbedtls"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# High quality, one-dimensional sample-rate conversion library
brew "libsoxr"
# Transcode video stabilization plugin
brew "libvidstab"
# VP8/VP9 video codec
brew "libvpx"
# Audio codecs extracted from Android open source project
brew "opencore-amr"
# Fastest and safest AV1 video encoder
brew "rav1e"
# Audio time stretcher tool and library
brew "rubberband"
# Compression/decompression library aiming for high speed
brew "snappy"
# Audio codec designed for speech
brew "speex"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Open video compression format
brew "theora"
# H.264/AVC encoder
brew "x264"
# H.265/HEVC encoder
brew "x265"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Scaling, colorspace conversion, and dithering library
brew "zimg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# JBIG2 decoder and library (for monochrome documents)
brew "jbig2dec"
# International domain name library
brew "libidn"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Image manipulation
brew "netpbm"
# Translates figures generated by xfig to other formats
brew "fig2dev"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Text-based UI library
brew "ncurses"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Lint your Python code for style and logical errors
brew "flake8"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Simplified packaging of Python modules
brew "flit"
# Open-source formatting library for C++
brew "fmt"
# Fast and simple Node.js version manager
brew "fnm"
# Extremely Fast Compression algorithm
brew "lz4"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# C++ mathematics library for graphics software
brew "glm"
# Command-line option parsing utility
brew "gnu-getopt"
# Japanese Chess
brew "gnu-shogi"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Numeric library for complex error functions
brew "libcerf"
# Powerful, lightweight programming language
brew "lua"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Library for handling OpenGL function pointer management
brew "libepoxy"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Seamless operability between C++11 and Python
brew "pybind11"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Software for mathematics, science, and engineering
brew "scipy"
# Efficient network analysis for Python 3
brew "graph-tool"
# Image processing tools collection
brew "graphicsmagick"
# GNU triangulated surface library
brew "gts"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Yet another part-of-speech and morphological analyzer
brew "mecab"
# IPA dictionary compiled for MeCab
brew "mecab-ipadic"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Fulltext search engine and column store
brew "groonga"
# Python overrides for gobject-introspection-based pygst bindings
brew "gst-python"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# Text view with syntax, undo/redo, and text marks
brew "gtksourceview"
# Text view with syntax, undo/redo, and text marks
brew "gtksourceview3"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Fork of youtube-dl, focused on bringing a fast, steady stream of updates
brew "haruhi-dl"
# Kubernetes package manager
brew "helm@2"
# View and edit files in hexadecimal or ASCII
brew "hexedit"
# Python clone of Foreman, for managing Procfile-based applications
brew "honcho"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Spell checker and morphological analyzer
brew "hunspell"
# Dialect of Lisp that's embedded in Python
brew "hy"
# Open h.265 video codec implementation
brew "libde265"
# Convert XML to another format (based on XSL or other tools)
brew "xmlto"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# C/C++ seam carving library
brew "liblqr"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Python wrapper for the various Internet Archive APIs
brew "internetarchive"
# Interactive computing in Python
brew "ipython"
# Sort Python imports automatically
brew "isort"
# GNOME XML library
brew "libxml2"
# Make XML documents translatable through PO files
brew "itstool"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Filter JSON and JSON Lines data with Python syntax
brew "jello"
# Convert JPG images to ASCII
brew "jp2a"
# JSON parser for C
brew "json-c"
# Implementation of JSON Schema for Python
brew "jsonschema"
# Python implementation written in Java (successor to JPython)
brew "jython"
# Code coverage tester for compiled programs, Python, and shell scripts
brew "kcov"
# Knowledgebase of Interatomic Models (KIM) API
brew "kim-api"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Git wrapper for GitLab
brew "lab"
# Objective Caml interface to gtk+
brew "lablgtk"
# Molecular Dynamics Simulator
brew "lammps"
# Manage the application landscape in a Kubernetes cluster
brew "landscaper"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Web application for archival and reading of manga/doujinshi
brew "lanraragi"
# Linear Algebra PACKage
brew "lapack"
# C++ stream output interface for creating Postscript documents
brew "lasi"
# XML security library
brew "libxmlsec1"
# Library for Liberty Alliance and SAML protocols
brew "lasso"
# LastPass command-line interface tool
brew "lastpass-cli"
# Pairwise aligner for DNA sequences
brew "lastz"
# Lossless LiDAR compression
brew "laszip"
# LaTeX-to-HTML translator
brew "latex2html"
# Translate LaTeX to RTF
brew "latex2rtf"
# Compare and mark up LaTeX file differences
brew "latexdiff"
# Add indentation to LaTeX files
brew "latexindent"
# LaTeX to XML/HTML/MathML Converter
brew "latexml"
# Lenguaje de programación de código abierto para latinos y de habla hispana
brew "latino"
# Command-line launcher for macOS, in the spirit of `open`
brew "launch"
# Bind to privileged ports without running a server as root
brew "launch_socket_server", restart_service: true
# Bash completion for Launchctl
brew "launchctl-completion"
# Mini DNS server designed solely to route queries to localhost
brew "launchdns"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Little brother's database for the mutt mail reader
brew "lbdb"
# Parallel bzip2 utility
brew "lbzip2"
# Open source neural network based chess engine
brew "lc0"
# Manipulate OpenType and multiple-master fonts
brew "lcdf-typetools"
# Interpreter for the lambda calculus
brew "lci"
# Libraries and tools for message passing and data marshalling
brew "lcm"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Generic password cracker
brew "lcrack"
# Satirical console-based political role-playing/strategy game
brew "lcs"
# Build tool for sending feature flag code references to LaunchDarkly
brew "ld-find-code-refs"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Update LDAP entries with a text editor
brew "ldapvi"
# Next-gen compiler infrastructure
brew "llvm@12"
# Portable D programming language compiler
brew "ldc"
# Library for Apple Binary- and XML-Property Lists
brew "libplist"
# Lets you manipulate the signature block in a Mach-O binary
brew "ldid"
# DNS library written in C
brew "ldns"
# Compiled programming language inspired by COBOL
brew "ldpl"
# Text editor with block and binary operations
brew "le"
# General purpose reloader for all projects
brew "leaf", link: false
# Lightweight and fast proxy utility
brew "leaf-proxy"
# CLI Java memory leak explorer for LeakCanary
brew "leakcanary-shark"
# Theorem prover
brew "lean"
# Command-line tool to develop and manage LeanCloud apps
brew "lean-cli", link: false
# Collaborative web-based text editing service written in Golang
brew "leaps"
# Command-line, double-entry accounting tool
brew "ledger"
# Line editor for interactive commands
brew "ledit"
# Neural Network Go engine with no human-provided knowledge
brew "leela-zero"
# Fast and powerful Git hooks manager for any type of projects
brew "lefthook"
# Command-line interface for Git, optimized for workflow simplicity
brew "legit"
# Let's Encrypt client and ACME library
brew "lego"
# Build tool for Clojure
brew "leiningen"
# LALR(1) parser generator like yacc or bison
brew "lemon"
# Remove defects from digital images
brew "lensfun"
# Tool for managing JavaScript projects with multiple packages
brew "lerna"
# Pager program similar to more
brew "less"
# Input filter for the pager less
brew "lesspipe"
# X.Org: Inter-Client Exchange Library
brew "libice"
# X.Org: X Session Management Library
brew "libsm"
# X.Org: X Toolkit Intrinsics library
brew "libxt"
# Open source implementation of OSF/Motif
brew "lesstif"
# Key-value storage library with ordered mapping
brew "leveldb"
# Fast embeddable web browser engine written in C with no dependencies
brew "lexbor"
# Terminal file manager
brew "lf"
# Concurrent Lisp for the Erlang VM
brew "lfe"
# Layer Four Traceroute (LFT), an advanced traceroute tool
brew "lft"
# Sophisticated file transfer program
brew "lftp"
# Unofficial downloader for GOG.com games
brew "lgogdownloader"
# Utility for creating and opening lzh archives
brew "lha"
# Secure hashing function
brew "libb2"
# QR Code generation
brew "qrencode"
# Bitcoin Blockchain Library
brew "libbitcoin-blockchain"
# EXIF parsing library
brew "libexif"
# Implements the IPFIX Protocol as a C library
brew "libfixbuf"
# Collection library providing GObject-based interfaces
brew "libgee"
# Database connectivity layer based on ODBC. (alternative to unixodbc)
brew "libiodbc"
# Implementation of the file(1) command
brew "libmagic"
# C library for the MaxMind DB file format
brew "libmaxminddb"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Library from the Modplug-XMMS project
brew "libmodplug"
# Interact with monome devices via C, Python, or FFI
brew "libmonome"
# Library for Qalculate! program
brew "libqalculate"
# General purpose TCP-IP emulator
brew "libslirp"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# C++ bittorrent library with Python bindings
brew "libtorrent-rasterbar"
# VNC server and client libraries
brew "libvncserver"
# X.Org: X miscellaneous utility routines library
brew "libxmu"
# X.Org: X Pixmap (XPM) image file format library
brew "libxpm"
# X.Org: X Athena Widget Set
brew "libxaw"
# X.Org: 3D Athena widget set based on the Xt library
brew "libxaw3d"
# X.Org: Header files for the XFIXES extension
brew "libxfixes"
# X.Org: X FreeType library
brew "libxft"
# X.Org: Library for the X Input Extension
brew "libxi"
# X.Org: API for Xinerama extension to X11 Protocol
brew "libxinerama"
# Keyboard configuration database for the X Window System
brew "xkeyboardconfig"
# Keyboard handling library
brew "libxkbcommon"
# C library for playback of module music (MOD, S3M, IT, etc)
brew "libxmp"
# X.Org: X Resize, Rotate and Reflection extension library
brew "libxrandr"
# X.Org: Client API for the XTEST & RECORD extensions
brew "libxtst"
# YAML Parser
brew "libyaml"
# C library for manipulating Yubico one-time passwords
brew "libyubikey"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Command-line utility to interact with linkerd
brew "linkerd"
# Scalable user load testing tool written in Python
brew "locust"
# Forked version of log4cpp for the Shibboleth project
brew "log4shib"
# Python generator for the console
brew "lorem"
# Tools for zmodem/xmodem/ymodem file transfer
brew "lrzsz"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]
# OpenResty's Branch of LuaJIT 2
brew "luajit-openresty"
# Drop-in replacement for MySQL
brew "mariadb", link: false
# Safe, concurrent, practical language
brew "rust"
# Build and publish Rust crates as Python packages
brew "maturin"
# Java-based project management
brew "maven"
# C Markdown parser. Fast. SAX-like interface
brew "md4c"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Modern and intuitive terminal-based text editor
brew "micro"
# Python implementation for microcontrollers and constrained systems
brew "micropython"
# C driver for MongoDB
brew "mongo-c-driver"
# C++ driver for MongoDB
brew "mongo-cxx-driver"
# REST API to manage MongoDB configurations on a single host
brew "mongo-orchestration", restart_service: true
# MongoDB CLI enables you to manage your MongoDB in the Cloud
brew "mongocli"
# Experimental optional static type checker for Python
brew "mypy"
# Open source relational database management system
brew "mysql", restart_service: true
# MySQL database connector for C++ applications
brew "mysql-connector-c++"
# Install one or more MySQL servers
brew "mysql-sandbox"
# Lightweight cloud messaging system
brew "nats-server", restart_service: true
# Lightweight cloud messaging system
brew "nats-streaming-server", restart_service: true
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Neural Simulation Tool (NEST) with Python3 bindings (PyNEST)
brew "nest"
# Small build system for use with gyp or CMake
brew "ninja"
# Distributed, Highly Available, Datacenter-Aware Scheduler
brew "nomad", restart_service: true
# Flexible test automation for Python
brew "nox"
# Platform-neutral API for system-level and libc-like functions
brew "nspr"
# Libraries for security-enabled client and server applications
brew "nss"
# C++ implementation of the Python Numpy library
brew "numcpp"
# Package for scientific computing with Python
brew "numpy@1.16"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# C library to read whole-slide images (a.k.a. virtual slides)
brew "openslide"
# Server for Ruby, Python, and Node.js apps via Apache/NGINX
brew "passenger"
# Middleware to access a smart card using SCard API
brew "pcsc-lite"
# Modern Python package manager with PEP 582 support
brew "pdm"
# Simplistic interactive filtering tool
brew "peco"
# Library to provide abstract access to various archives
brew "physfs"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Audits Python environments and dependency trees for known vulnerabilities
brew "pip-audit"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Library to simplify the interaction with PKCS#11
brew "pkcs11-helper"
# Create macOS applications from {Perl,Ruby,sh,Python} scripts
brew "platypus"
# Python package management tool
brew "poetry"
# Protocol adapter to run UCI engines under XBoard
brew "polyglot"
# Service monitoring system and time series database
brew "prometheus", restart_service: true
# Advanced Python REPL
brew "ptpython"
# Sampling profiler for Python programs
brew "py-spy"
# Python 2 bindings for the Cairo graphics library
brew "py2cairo"
# Simple Python style checker in one Python file
brew "pycodestyle"
# Python docstring style checker
brew "pydocstyle"
# Python version management
brew "pyenv"
# Make Python build faster, using the leverage of `ccache`
brew "pyenv-ccache"
# Migrate pip packages from one Python version to another
brew "pyenv-pip-migrate"
# Installation and dependency system for Python
brew "pyflow"
# Bundle a Python application and all its dependencies
brew "pyinstaller"
# Pythonic task management & command execution
brew "pyinvoke"
# Modern Python application packaging and distribution tool
brew "pyoxidizer"
# Cross-platform application and UI framework
brew "qt"
# Python bindings for v6 of Qt
brew "pyqt"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Static type checker for Python
brew "pyright"
# Official Python bindings for Qt
brew "pyside"
# Launch your Python interpreter the lazy/smart way
brew "python-launcher"
# Python implementation of Markdown
brew "python-markdown"
# Pretty-print tabular data in Python
brew "python-tabulate"
# Python interface to Tcl/Tk
brew "python-tk@3.10"
# Run SQL directly on CSV or TSV files
brew "q"
# Multi-purpose desktop calculator
brew "qalculate-gtk"
# Build tool for developing projects across multiple platforms
brew "qbs"
# Qt Cryptographic Architecture (QCA)
brew "qca"
# Visualize data generated by Cachegrind and Calltree
brew "qcachegrind"
# Qt Widgets for Technical Applications
brew "qwt-qt5"
# Report audiovisual metrics via libavfilter
brew "qcli"
# C++/Fortran-90 double-double and quad-double package
brew "qd"
# Quick and Dirty Apricot Emulator
brew "qdae"
# Library of routines for managing a database
brew "qdbm"
# Ethernet compliant virtual network
brew "vde"
# Emulator for x86 and PowerPC
brew "qemu"
# Computes convex hulls in n dimensions
brew "qhull"
# Simple Qt application to control the JACK sound server daemon
brew "qjackctl"
# Map JSON to QVariant objects
brew "qjson"
# Terminal emulator and BBS client
brew "qodem"
# Command-line (ND)JSON querying
brew "qp"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# High-performance, lightweight AMQP 1.0 messaging library
brew "qpid-proton"
# Package manager for Qt applications
brew "qpm"
# Encoder and decoder for quoted-printable encoding
brew "qprint"
# Transfer files to and from your computer by scanning a QR code
brew "qrcp"
# Fast updates of QR and Cholesky decompositions
brew "qrupdate"
# Port to Qt of the Scintilla editing component
brew "qscintilla2"
# Query Quake servers from the command-line
brew "qstat"
# Qt SQL Database Driver
brew "qt-libiodbc"
# Qt SQL Database Driver
brew "qt-mariadb", link: false
# Qt SQL Database Driver
brew "qt-mysql"
# Parse video download URLs
brew "quvi"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Library for creating multi-platform software
brew "s-lang"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# Graphics drawing primitives and other support functions
brew "sdl_gfx"
# Image file loading library
brew "sdl_image"
# Library for using TrueType fonts in SDL applications
brew "sdl_ttf"
# Web-Scale Blockchain for decentralized apps and marketplaces
brew "solana"
# Action-RPG game engine
brew "solarus"
# Contract-oriented programming language
brew "solidity"
# Zsh prompt for Astronauts
brew "spaceship"
# Cross-shell prompt for astronauts
brew "starship"
# High-performance system programming language
brew "swift"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal image and video viewer
brew "timg"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Generates ASCII tractor art
brew "tractorgen"
# Unidentified Flying RAW: RAW image processing utility
brew "ufraw"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Creates video contact sheets (previews) of videos
brew "vcs"
# Watch files and take action when they change
brew "watchman"
# VNC server for real X displays
brew "x11vnc"
# IBM 3270 terminal emulator for the X Window System and Windows
brew "x3270"
# GNU Binutils for x86_64-elf cross development
brew "x86_64-elf-binutils"
# GNU compiler collection for x86_64-elf
brew "x86_64-elf-gcc"
# GNU debugger for x86_64-elf cross development
brew "x86_64-elf-gdb"
# 6502 cross assembler
brew "xa"
# C++ search engine library
brew "xapian"
# IRC client
brew "xaric"
# X.Org Applications: xauth
brew "xauth"
# XBee communication libraries and utilities
brew "xbee-comm"
# Bitmap images used by multiple X11 applications
brew "xbitmaps"
# Graphical user interface for chess
brew "xboard"
# X.Org: XML-XCB protocol descriptions for libxcb code generation
brew "xcb-proto"
# Additional extensions to the XCB library
brew "xcb-util"
# XCB port of Xlib's XImage and XShmImage
brew "xcb-util-image"
# Convenience functions for the X Render extension
brew "xcb-util-renderutil"
# XCB cursor library (replacement for libXcursor)
brew "xcb-util-cursor"
# Standard X constants and conversion to/from keycodes
brew "xcb-util-keysyms"
# Client and window-manager helpers for EWMH and ICCCM
brew "xcb-util-wm"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Xcode version manager
brew "xcenv"
# Tool to get information about and install available Xcode versions
brew "xcinfo"
# Access X11 clipboards from the command-line
brew "xclip"
# Tool to parse the SLF serialization format used by Xcode
brew "xclogparser"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Manipulate Xcode project files
brew "xcproj"
# Xcode project linter
brew "xcprojectlint"
# Cut, copy and paste files with Bash
brew "xcv"
# Binary diff, differential compression tools
brew "xdelta"
# Interactive viewer for graphs written in Graphviz's dot language
brew "xdot"
# Fake keyboard/mouse input and window management for X
brew "xdotool"
# X.Org: Utility for displaying information about an X server
brew "xdpyinfo"
# Facility for interactive generation of figures
brew "xfig"
# Scalable, Portable and Distributed Gradient Boosting Library
brew "xgboost"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Utility to configure and test X input devices
brew "xinput"
# Statistical data science environment based on Lisp
brew "xlispstat"
# C++/C library to construct Excel .xls files in code
brew "xlslib"
# Cross-platform build utility based on Lua
brew "xmake"
# Powerful interactive system for text processing
brew "xml-coreutils"
# Implementation of primary security standards for XML
brew "xml-security-c"
# Provides a higher level interface to XML processing
brew "xml-tooling-c"
# Makes XML and HTML more amenable to classic UNIX text tools
brew "xml2"
# Manipulate SGML and XML catalogs
brew "xmlcatmgr"
# Format XML documents
brew "xmlformat"
# Lightweight RPC library (based on XML and HTTP)
brew "xmlrpc-c"
# Check schema validity and signature of an XML document
brew "xmlsectool"
# XML command-line utilities
brew "xmlstarlet"
# XML to manpage converter
brew "xmltoman"
# Command-line player for module music formats (MOD, S3M, IT, etc)
brew "xmp"
# Monero (XMR) CPU miner
brew "xmrig"
# Python-powered, cross-platform, Unix-gazing shell language and command prompt
brew "xonsh"
# X.Org: color names database
brew "xorgrgb"
# ISO9660+RR manipulation tool
brew "xorriso"
# Seamless communication between Unix programs
brew "xpa"
# PDF viewer
brew "xpdf"
# Hackable, minimal, fast TUI file explorer
brew "xplr"
# Platform for building proxies to bypass network restrictions
brew "xray", restart_service: true
# Clone of Rick Dangerous
brew "xrick"
# High performance, scalable, fault-tolerant access to data
brew "xrootd"
# XML Data Binding for C++
brew "xsd"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# X11 interface for GNU Shogi
brew "xshogi"
# Modern, portable C++ wrappers for SIMD intrinsics
brew "xsimd"
# Fast CSV toolkit written in Rust
brew "xsv"
# Slide show presentation tool
brew "xsw"
# Multi-dimensional arrays with broadcasting and lazy computing
brew "xtensor"
# Terminal emulator for the X Window System
brew "xterm"
# Set window title and icon for your X terminal
brew "xtitle"
# X.Org: X Network Transport layer shared code
brew "xtrans"
# Bring your favorite shell wherever you go through the ssh
brew "xxh"
# Extremely fast non-cryptographic hash algorithm
brew "xxhash"
# General purpose computer algebra system
brew "yacas"
# Yet Another Dotfiles Manager
brew "yadm"
# Yet another elegant Go interpreter
brew "yaegi"
# Yet another flowmeter: processes packet data from pcap(3)
brew "yaf"
# Command-line FTP client
brew "yafc"
# Yet Another JSON Library
brew "yajl"
# Add metadata to Flash video
brew "yamdi"
# C++ YAML parser and emitter for YAML 1.2 spec
brew "yaml-cpp"
# Linter for YAML files
brew "yamllint"
# Copy terminal output to clipboard
brew "yank"
# Formatter for python code
brew "yapf"
# Malware identification and classification tool
brew "yara"
# JavaScript package manager
brew "yarn"
# Bash completion for Yarn
brew "yarn-completion"
# Yet another shell: a POSIX-compliant command-line shell
brew "yash"
# Modular BSD reimplementation of NASM
brew "yasm"
# Webserver for dynamic content (written in Erlang)
brew "yaws"
# Toolkit for Z39.50/SRW/SRU clients/servers
brew "yaz"
# Yet Another Z80 Emulator (by AG)
brew "yaze-ag"
# C++ API for the Yaz toolkit
brew "yazpp"
# TCP traffic analyzer
brew "yconalyzer"
# YouDao Console Version
brew "ydcv"
# View colored diff with side by side and auto pager support
brew "ydiff"
# Tools that help create and edit Mallard or DocBook documentation
brew "yelp-tools"
# Customizable Tetris for the terminal
brew "yetris"
# YAML syntax highlighter to bring colours where only jq could
brew "yh"
# CLI to convert between YAML, TOML, JSON and HCL
brew "yj"
# Library to validate YubiKey OTPs against YubiCloud
brew "ykclient"
# Video downloader that focus on China mainland video sites
brew "ykdl"
# Tool for managing your YubiKey configuration
brew "ykman"
# CLI and C library to interact with the CCID-part of the YubiKey NEO
brew "ykneomgr"
# YubiKey personalization library and tool
brew "ykpers"
# Download Yle videos from the command-line
brew "yle-dl"
# Framework for Verilog RTL synthesis
brew "yosys"
# Dumb downloader that scrapes the web
brew "you-get"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Media downloader supporting various sites such as youtube
brew "youtube-dlc"
# Download Youtube Video in Golang
brew "youtubedr"
# Scripted uploads to Youtube
brew "youtubeuploader"
# Process YAML documents from the CLI
brew "yq"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Command-line tool for the YubiKey PIV application
brew "yubico-piv-tool"
# Seamless ssh-agent for YubiKeys and other PIV tokens
brew "yubikey-agent", restart_service: true
# Decode yEnc archives
brew "yydecode"
# Tracks most-used directories to make cd smarter
brew "z"
# New cd command that helps you navigate faster by learning your habits
brew "z.lua"
# High-performance theorem prover
brew "z3"
# Assembler for the Zilog Z80 microprcessor and compatibles
brew "z80asm"
# Disassembler for the Zilog Z80 microprocessor and compatibles
brew "z80dasm"
# Availability and monitoring solution
brew "zabbix"
# CLI tool for interacting with Zabbix monitoring system
brew "zabbix-cli"
# Suite of barcodes-reading tools
brew "zbar"
# GameBoy emulator
brew "zboy"
# Information management system
brew "zebra"
# Network security monitor
brew "zeek"
# Zelda Return of the Hylian SE
brew "zelda-roth-se"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# In terminal graphical metrics for your *nix system
brew "zenith"
# GTK+ dialog boxes for the command-line
brew "zenity"
# Decentralised cross-platform software installation system
brew "zero-install"
# CLI utility to find the union, intersection, and set difference of files
brew "zet"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Text editor development kit
brew "zile"
# Graphical text editor used to maintain a collection of wiki pages
brew "zim"
# Stand-alone version of sbt's Scala incremental compiler
brew "zinc"
# Flexible and fast Zsh plugin manager
brew "zinit"
# Barcode encoding library supporting over 50 symbologies
brew "zint"
# Compression and file packaging/archive utility
brew "zip"
# Fast, partitioned convolution engine library
brew "zita-convolver"
# General-purpose lossless data-compression library
brew "zlib"
# Zlib replacement with optimizations for next generation systems
brew "zlib-ng"
# Network scanner for Internet-wide network studies
brew "zmap"
# High-level C++ binding for zeromq
brew "zmqpp"
# ZFS backup with remote capabilities and mbuffer integration
brew "znapzend", restart_service: true
# Advanced IRC bouncer
brew "znc", restart_service: true
# Fast static site generator in a single binary with everything built-in
brew "zola"
# Centralized server for distributed coordination of services
brew "zookeeper", restart_service: true
# New zlib (gzip, deflate) compatible compressor
brew "zopfli"
# NoSQL query processor
brew "zorba"
# Dungeon modified from FORTRAN to C
brew "zork"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Incremental, journaling command-line archiver
brew "zpaq"
# Next-generation plugin manager for zsh
brew "zplug"
# One-stop ZFS backup & replication solution
brew "zrepl", restart_service: true
# Zelda Mystery of Solarus DX
brew "zsdx"
# UNIX shell (command interpreter)
brew "zsh"
# Perform tasks asynchronously without external tools
brew "zsh-async"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Tips, tricks, and examples for zsh
brew "zsh-lovers"
# Zsh curses-based tools, e.g. multi-word history searcher
brew "zsh-navigation-tools"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# ZSH plugin that reminds you to use existing aliases for commands you just typed
brew "zsh-you-should-use"
# Debugger for zsh
brew "zshdb"
# Interactive file transfers over SSH
brew "zssh"
# Zelda Mystery of Solarus XD
brew "zsxd"
# File transfer program
brew "zsync"
# HTTP and WebSocket client worker with ZeroMQ interface
brew "zurl"
# CP/M 2/3 emulator for cross-compiling and CP/M tools under UNIX
brew "zxcc"
# Fast and lightweight x86/x86_64 disassembler library
brew "zydis"
# Local Area Clustering for Peer-to-Peer Applications
brew "zyre"
# Transparent application input fuzzer
brew "zzuf"
# Command-line tool to put Macs to sleep
brew "zzz"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@4.4"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Text, code, and markup editor
cask "bbedit"
cask "font-hack-nerd-font"
# Personal blockchain for Ethereum development
cask "ganache"
# Git client focusing on productivity
cask "gitkraken"
# Go (golang) IDE
cask "goland"
# Terminal built on web technologies
cask "hyper"
# Desktop application for JupyterLab
cask "jupyterlab"
# Automation software
cask "keyboard-maestro"
# Minimal installer for conda
cask "miniconda"
# PHP IDE by JetBrains
cask "phpstorm"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Ruby on Rails IDE
cask "rubymine"
# Screen recorder with audio
cask "screenflick"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
